[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:36:31
     },
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      ...(personalSchedule.description && { description: personalSchedule.description }),
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const mutation = useBackendMutation(
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/personalschedules/list"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:45:11
     data: {
       user: personalSchedule.user,
       name: personalSchedule.name,
-      ...(personalSchedule.description && { description: personalSchedule.description }),
+      ...(personalSchedule.description || {
+  description: personalSchedule.description
+}),
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:45:11
     data: {
       user: personalSchedule.user,
       name: personalSchedule.name,
-      ...(personalSchedule.description && { description: personalSchedule.description }),
+      ...(false),
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality
