[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:73:13
 
   const objectToAxiosParamsUpdateGradeInfoJob = () => ({
     url: "/api/jobs/launch/uploadGradeData",
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
