[Killed] BlockStatement
main/pages/Admin/AdminJobLogPage.js:6:31
 import { Button } from "react-bootstrap";
 import { useBackend } from "main/utils/useBackend";
 
-const AdminJobLogPage = () => {
-  const { id } = useParams();
-  const navigate = useNavigate();
-
-  const { data: jobLogs } = useBackend([`/api/jobs/logs/${id}`], {
-    method: "GET",
-    url: `/api/jobs/logs/${id}`,
-  });
-
-  const handleBack = () => {
-    navigate("/admin/jobs");
-  };
-
-  return (
-    <div>
-      <Button onClick={handleBack}>Back to Job List</Button>
-      <h3>Job Logs for Job {id}</h3>
-      {jobLogs ? <pre>{jobLogs}</pre> : <p>Loading...</p>}
-    </div>
-  );
-};
+const AdminJobLogPage = () => {};
 
 export default AdminJobLogPage;
killedBy: AdminJobLogPage tests renders the AdminJobLogPage with back button and header
statusReason: TestingLibraryElementError: Unable to find an element with the text: Back to Job List. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobLogPage.js:10:40
   const { id } = useParams();
   const navigate = useNavigate();
 
-  const { data: jobLogs } = useBackend([`/api/jobs/logs/${id}`], {
+  const { data: jobLogs } = useBackend([], {
     method: "GET",
     url: `/api/jobs/logs/${id}`,
killedBy: AdminJobLogPage tests ensures correct URL and method are used
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.
