[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:33:5
   const navigate = useNavigate();
 
   const [quarter, setQuarter] = useState(
-    {
-      quarters: quarters,
-    }.quarters[quarters.length - 1],
+    {}.quarters[quarters.length - 1],
   );
 
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleForm.js:35:16
   const [quarter, setQuarter] = useState(
     {
       quarters: quarters,
-    }.quarters[quarters.length - 1],
+    }.quarters[quarters.length + 1],
   );
 
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:41:8
   const quarterMap = {
     1: "W",
     2: "S",
-    3: "M",
+    3: "",
     4: "F",
   };
killedBy: PersonalScheduleForm tests Form has initialPersonalSchedule content with Summer quarter
statusReason: Error: expect(element).toHaveValue(M22)

Expected the element to have value:
  M22
Received:
  22

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:47:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialPersonalSchedule && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="PersonalScheduleForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialPersonalSchedule.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: PersonalScheduleForm tests renders correctly when passing in a PersonalSchedule
statusReason: Error: Unable to find an element by: [data-testid="/PersonalScheduleForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:88:24
           id="description"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("description", {})}
+          {...register("", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:101:26
             data-testid="PersonalScheduleForm-quarter"
             id="quarter"
             type="text"
-            {...register("quarter")}
+            {...register("")}
             value={
               quarterMap[initialPersonalSchedule.quarter.substring(4, 5)] +
killedBy: PersonalScheduleForm tests renders correctly when passing in a PersonalSchedule
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
