[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function PersonalSchedulesCreatePage() {
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules/post",
-    method: "POST",
-    params: {
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = () => {};
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:33:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const quarter = {
-      quarter: localStorage["PersonalScheduleForm-quarter"],
-    };
-    console.log(quarter);
-    const dataFinal = Object.assign(data, quarter);
-    console.log(dataFinal);
-    mutation.mutate(dataFinal);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess) {
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
