[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:30:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/personalschedules`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'substring')

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:36:31
     },
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      ...(personalSchedule.description && {
-        description: personalSchedule.description,
-      }),
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const mutation = useBackendMutation(
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/personalschedules/list"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:39:13
   const objectToAxiosParams = (personalSchedule) => ({
     url: "/api/personalschedules",
     method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
+    params: {},
     data: {
       user: personalSchedule.user,
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:45:11
     data: {
       user: personalSchedule.user,
       name: personalSchedule.name,
-      ...(personalSchedule.description && {
-        description: personalSchedule.description,
-      }),
+      ...(personalSchedule.description || {
+  description: personalSchedule.description
+}),
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:45:11
     data: {
       user: personalSchedule.user,
       name: personalSchedule.name,
-      ...(personalSchedule.description && {
-        description: personalSchedule.description,
-      }),
+      ...(false),
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality
