[Killed] LogicalOperator
main/components/Sections/SectionsTable.js:124:5
 
 export const onError = (error) => {
   const message =
-    error.response?.data?.message || "An unexpected error occurred";
+    error.response?.data?.message && "An unexpected error occurred";
   toast.error(message);
 };
killedBy: Section tests calls onError when mutation throws an error and calls toast with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "class exists in schedule"
Received: "An unexpected error occurred"

Number of calls: 1

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:226:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Enroll Code",
-      accessor: "section.enrollCode",
-      disableGroupBy: true,
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Info",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!
