[Killed] StringLiteral
main/components/Jobs/JobsTable.js:23:17
     },
     {
       Header: "Log",
-      accessor: "log",
+      accessor: "",
       Cell: ({ cell }) => {
         const log = cell.row.original.log;
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="JobsTable-cell-row-0-col-Log"]

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="JobsTable-cell-row-0-col-Log"
  role="cell"

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:24:27
     {
       Header: "Log",
       accessor: "log",
-      Cell: ({ cell }) => {
-        const log = cell.row.original.log;
-        const logLines = log ? log.split("\n") : [];
-        return (
-          <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
-            {logLines.length > 10 ? (
-              <>
-                {logLines.slice(0, 10).join("\n")}
-                <span>...</span>
-                <br />
-                <Link to={`/admin/jobs/logs/${cell.row.original.id}`}>
-                  See entire log
-                </Link>
-              </>
-            ) : (
-              <pre>{log}</pre>
-            )}
-          </div>
-        );
-      },
+      Cell: ({ cell }) => {},
     },
   ];
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-Log"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Survived] MethodExpression
main/components/Jobs/JobsTable.js:31:18
           <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
             {logLines.length > 10 ? (
               <>
-                {logLines.slice(0, 10).join("\n")}
+                {logLines.join("\n")}
                 <span>...</span>
                 <br />

[Survived] StringLiteral
main/components/Jobs/JobsTable.js:34:27
                 {logLines.slice(0, 10).join("\n")}
                 <span>...</span>
                 <br />
-                <Link to={`/admin/jobs/logs/${cell.row.original.id}`}>
+                <Link to={``}>
                   See entire log
                 </Link>
